#+TITLE: Portfolio Construction using Black-Litterman Model and Factors
#+AUTHOR: Alvaro Cea
#+PROPERTY: header-args :tangle ./main.py :mkdirp yes
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \usepackage{mathtools}

#+begin_comment
#+OPTIONS: toc:nil
#+LATEX_HEADER: \let\oldsection\section
#+LATEX_HEADER: \renewcommand{\section}{\clearpage\oldsection}
#+LATEX_HEADER: \let\oldsubsection\subsection
#+LATEX_HEADER: \renewcommand{\subsection}{\clearpage\oldsubsection}
#+end_comment

*** Asset selection
#+begin_src python  :results none
  sp500 = financial_features.FinancialData("^GSPC",
                                           config.start_date_assets,
                                           config.end_date_assets)
  df_sp500 = sp500.df['return_log'].dropna()
#+end_src

#+begin_src python  :results none
  tickers_sp500 = ml4qf.collectors.scrap_tickers_index(config.index_weblist)
  df_tickers_sp500 = ml4qf.collectors.get_tickers_info(tickers_sp500,
                                                       config.info_sp500,
                                                       data_folder="./data",
                                                       name_family="sp500")
  df_tickers_sp500.dropna(inplace=True)
  df_tickers_filtered = ml4qf.utils.date_filter_lower(df_tickers_sp500,
                                                      'first_date',
                                                      date_lower=config.start_date_assets)
  df_tickers_filtered =  df_tickers_filtered.sort_values('marketCap',ascending=False)
  df_selected_tickers = ml4qf.collectors.select_assets(df_tickers_filtered,
                                                       config.ASSET_SELECTION_PCT,
                                                       config.ASSET_SELECTION_NAMES)
  # #FinancialDataContainer
  w_mkt = df_selected_tickers.marketCap / df_selected_tickers.marketCap.sum()
  num_assets = len(df_selected_tickers)
#+end_src



#+NAME: Market cap equilibrium weights
#+begin_src python :results output
  portfolios_path = pathlib.Path("./data/portfolios/")
  portfolios_path.mkdir(parents=True, exist_ok=True)
  portfolios_file = portfolios_path / ("_".join(df_selected_tickers.index))
  if not portfolios_file.is_file():
      df_selected_tickers.to_csv(portfolios_file)
  print(w_mkt)
  #w_mkt = w_mkt.to_numpy()
#+end_src

#+RESULTS: Market cap equilibrium weights
#+begin_example
JPM      0.491942
CMCSA    0.207776
ADI      0.102000
PH       0.059630
DXCM     0.047344
TSCO     0.027034
AEE      0.023417
CAG      0.016425
CE       0.015118
FRT      0.009313
Name: marketCap, dtype: float64
#+end_example

#+RESULTS:
#+begin_example
KO      0.430949
LOW     0.211659
GS      0.185425
ALGN    0.043380
FICO    0.035078
DOV     0.032496
ATO     0.027659
ESS     0.026347
DXC     0.007006
Name: marketCap, dtype: float64
#+end_example

*** Factor regression
#+begin_src python :results none
  factor_models = financial_factors.factors_regression(factor_names,
                                                      df_factors_train,
                                                      df_assets_train,
                                                      regression_kernel=regression_OLS)
  alpha, beta = financial_factors.compute_factors_coeff(factor_models)
  factor_model = financial_factors.factor_lin_generator(alpha, beta)
#+end_src

#+NAME: df_train_factors
#+begin_src python  :results raw :exports results
  albe = np.vstack([alpha, beta]).T
  df_index = asset_names
  df_columns = ['alpha'] + factor_names
  df_train_factors = pd.DataFrame(albe, columns=df_columns, index=df_index)
  tabulate(df_train_factors, headers=df_columns, showindex=True, tablefmt='orgtbl')
#+end_src

#+RESULTS: df_train_factors
|       |       alpha |   Mkt-RF |        SMB |       HML |        RMW |        CMA |        MOM |
|-------+-------------+----------+------------+-----------+------------+------------+------------|
| JPM   |  0.00445065 |  1.10652 |  -0.440155 |   1.40538 |   -1.24112 |  -0.824686 | -0.0246697 |
| CMCSA |   0.0013236 |  1.07818 |  -0.331769 | -0.109582 | -0.0620382 |   0.709663 |  -0.134245 |
| ADI   |  0.00284991 |   1.0065 |   0.470268 | 0.0107203 |   0.101693 |  -0.426269 |  -0.367543 |
| PH    |  -0.0023811 |  1.37354 |   0.543136 |  0.193102 |   0.399803 | -0.0483402 |  -0.298496 |
| DXCM  |   0.0303054 | 0.374555 |    1.41041 |  -1.78457 |  -0.936454 |    -1.1328 |  -0.356339 |
| TSCO  |  0.00455325 |  1.09016 |    0.55251 |  -0.63082 |   0.675689 |   0.972401 |  0.0849717 |
| AEE   |  0.00366709 | 0.476508 |  -0.136473 |  0.185148 |   0.372146 |   0.239563 |   0.481544 |
| CAG   |  -0.0011143 | 0.831855 |  -0.189053 | -0.238849 |   0.631176 |    1.16124 |  0.0633045 |
| CE    | 0.000539305 |  1.33332 | -0.0800048 |  0.681784 | -0.0613478 |  -0.528645 |  -0.129299 |
| FRT   | -0.00442393 | 0.574232 |   0.542634 |  0.401857 |   0.960915 |  -0.118601 |   0.184955 |

#+begin_src python :results output :exports results
  print(factor_models[df_assets.keys()[1]].summary())
#+end_src

#+RESULTS:
#+begin_example
                            OLS Regression Results                            
==============================================================================
Dep. Variable:                      y   R-squared:                       0.498
Model:                            OLS   Adj. R-squared:                  0.469
Method:                 Least Squares   F-statistic:                     17.50
Date:                Mon, 14 Aug 2023   Prob (F-statistic):           5.41e-14
Time:                        09:02:49   Log-Likelihood:                 201.27
No. Observations:                 113   AIC:                            -388.5
Df Residuals:                     106   BIC:                            -369.5
Df Model:                           6                                         
Covariance Type:            nonrobust                                         
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
const          0.0013      0.004      0.308      0.759      -0.007       0.010
x1             1.0782      0.118      9.114      0.000       0.844       1.313
x2            -0.3318      0.204     -1.628      0.107      -0.736       0.072
x3            -0.1096      0.210     -0.523      0.602      -0.525       0.306
x4            -0.0620      0.286     -0.217      0.829      -0.629       0.505
x5             0.7097      0.335      2.117      0.037       0.045       1.374
x6            -0.1342      0.145     -0.927      0.356      -0.421       0.153
==============================================================================
Omnibus:                        0.015   Durbin-Watson:                   2.215
Prob(Omnibus):                  0.993   Jarque-Bera (JB):                0.132
Skew:                          -0.010   Prob(JB):                        0.936
Kurtosis:                       2.834   Cond. No.                         91.5
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
#+end_example

#+begin_src python :session py1 :results none :exports none
  import getFamaFrenchFactors as gff
  import yfinance as yf
  import statsmodels.api as sm

  ticker = 'amzn'
  start = '2016-8-31'
  end = '2021-8-31'
  start = '2014-12-31'
  end = '2019-12-31'
  stock_data = yf.download(ticker, start, end)

  ff3_monthly = gff.famaFrench3Factor(frequency='m')
  #ff3_monthly = gff.famaFrench5Factor(frequency='m')
  #momentum_monthly = gff.momentumFactor(frequency='m')

  ff3_monthly.rename(columns={"date_ff_factors": 'Date'}, inplace=True)
  ff3_monthly.set_index('Date', inplace=True)

  stock_returns = stock_data['Close'].resample('M').last().pct_change().dropna()
  stock_returns.name = "Month_Rtn"
  ff_data = ff3_monthly.merge(stock_returns,on='Date')

  X = ff_data[['Mkt-RF', 'SMB', 'HML']]
  y = ff_data['Month_Rtn'] - ff_data['RF']
  X = sm.add_constant(X)
  ff_model = sm.OLS(y, X).fit()
#+end_src
#+begin_src python :session py1 :results output :exports results
  print(ff_model.summary())
#+end_src

#+RESULTS:
#+begin_example
                            OLS Regression Results                            
==============================================================================
Dep. Variable:                      y   R-squared:                       0.514
Model:                            OLS   Adj. R-squared:                  0.488
Method:                 Least Squares   F-statistic:                     19.73
Date:                Thu, 10 Aug 2023   Prob (F-statistic):           7.48e-09
Time:                        15:40:50   Log-Likelihood:                 86.579
No. Observations:                  60   AIC:                            -165.2
Df Residuals:                      56   BIC:                            -156.8
Df Model:                           3                                         
Covariance Type:            nonrobust                                         
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
const          0.0147      0.008      1.843      0.071      -0.001       0.031
Mkt-RF         1.5402      0.224      6.886      0.000       1.092       1.988
SMB           -0.6471      0.338     -1.914      0.061      -1.324       0.030
HML           -0.9529      0.297     -3.205      0.002      -1.549      -0.357
==============================================================================
Omnibus:                        2.723   Durbin-Watson:                   1.576
Prob(Omnibus):                  0.256   Jarque-Bera (JB):                2.361
Skew:                           0.485   Prob(JB):                        0.307
Kurtosis:                       2.949   Cond. No.                         46.3
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
#+end_example


#+begin_src python :results none
  returns_pred = factor_model(df_factors_test[factor_names].to_numpy())
  df_returns_pred = pd.DataFrame(returns_pred,
                                 columns=asset_names,
                                 index=df_assets_test.index)
#+end_src

